app/controllers/user_archives_controller.rb

SELECT * FROM "user_archives"
---
  def index
    @user_archives = UserArchive.all

SELECT * FROM "user_archives"
SELECT max("user_archives".archive_time) AS max_archive_time FROM "user_archives"
---
  def archive
    #@user_archives = UserArchive.all
    puts params[:sql]
    times=UserArchive.maximum("archive_time")

SELECT * FROM "user_archives" WHERE ("user_archives"."id" = 1)
---
  def show
    @user_archive = UserArchive.find(params[:id])

SELECT * FROM "user_archives" WHERE ("user_archives"."id" = 1)
---
  def edit
    @user_archive = UserArchive.find(params[:id])

INSERT INTO "user_archives" ("name", "created_at", "archive_time", "updated_at", "usr_updated", "usr_id", "usr_created", "email", "state") VALUES(NULL, '2010-12-23 02:22:06', NULL, '2010-12-23 02:22:06', NULL, NULL, NULL, NULL, NULL)
---
  def create
    @user_archive = UserArchive.new(params[:user_archive])

    respond_to do |format|
      if @user_archive.save

SELECT * FROM "user_archives" WHERE ("user_archives"."id" = 1)
UPDATE "user_archives" SET "usr_updated" = '2010-12-23 06:17:00', "updated_at" = '2010-12-23 06:17:28', "usr_created" = '2010-12-23 06:17:00' WHERE "id" = 1
---
  def update
    @user_archive = UserArchive.find(params[:id])

    respond_to do |format|
      if @user_archive.update_attributes(params[:user_archive])