app/controllers/usrs_controller.rb

SELECT * FROM "usrs"
---
  def index
    @usrs = Usr.all

SELECT * FROM "usrs" WHERE ("usrs"."id" = 1)
---
  def show
    @usr = Usr.find(params[:id])

INSERT INTO "usrs" ("name", "created_at", "updated_at", "email", "state") VALUES('1name', '2010-12-22 11:13:10', '2010-12-22 11:13:10', '1mail', '1state')
---
  def create
    @usr = Usr.new(params[:usr])

    respond_to do |format|
      if @usr.save